---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailSegmentLengthDimensionTextPosition
source: html/884e4839-7907-d627-805f-39e5cb3dc0fa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailSegmentLengthDimensionTextPosition Property

"Dimension Text Position"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailSegmentLengthDimensionTextPosition { get; }
```